import pulp

"""
Компанія виробляє два види напоїв: "Лимонад" і "Фруктовий сік". Для виробництва цих напоїв використовуються різні інгредієнти та обмежена кількість обладнання. Задача полягає у максимізації виробництва, враховуючи обмежені ресурси.

Умови:

"Лимонад" виготовляється з "Води", "Цукру" та "Лимонного соку".
"Фруктовий сік" виготовляється з "Фруктового пюре" та "Води".

Обмеження ресурсів: 
 - 100 од. "Води", 
 - 50 од. "Цукру", 
 - 30 од. "Лимонного соку" та 
 - 40 од. "Фруктового пюре".

Виробництво одиниці "Лимонаду" вимагає
 - 2 × Води
 - 1 × Цукру
 - 1 × Лимонного соку

Виробництво одиниці "Фруктового соку"
 - 2 × Фруктового пюре
 - 1 × Води"""

# ініціалазація моделі максимізації
model = pulp.LpProblem("Maximize beverage production", pulp.LpMaximize)

# Змінні - інгридієнти
Lemonade = pulp.LpVariable("Lemonade", lowBound=0, cat="Continuous")
Juice = pulp.LpVariable("Juice", lowBound=0, cat="Continuous")

# обмеження ресурсів:
model += 2 * Lemonade + 1 * Juice <= 100  # 100 од. "Води"
model += 1 * Lemonade <= 50  # 50 од. "Цукру"
model += 1 * Lemonade <= 30  # 30 од. "Лимонного соку"
model += 2 * Juice <= 40  # 40 од. "Фруктового пюре"

# Функція цілі (Максимізація прибутку)
model += Lemonade + Juice

# Розв'язання моделі
model.solve()

print(f"Статус розв'язку: {pulp.LpStatus[model.status]}\n")

# Виведення результатів
print("Для макисмізації загальної кількості продуктів потрібно виробляти:")
print(f"Лимонаду:        {Lemonade.varValue}од.")
print(f"Фруктового соку: {Juice.varValue}од.")
print()
